var sign_1 = [1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,0,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1];
var sign_2 = [1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,0,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1];
var sign_3 = [1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,0,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1];
var sign_4 = [1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,0,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1];
var sign_5 = [1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,0,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1];
var sign_6 = [1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,0,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1];
var sign_7 = [1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,0,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1];
var sign_8 = [1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,0,0,1,1,1,1,0,0,0,0,0,0,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1];
var sign_9 = [1,1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1];
var sign_10 = [1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1];
var sign_11 = [1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,1,1,1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,1,0,1,1];
var sign_12 = [1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,1,1,1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,1,1,1,1,1,1,1,0,0,0,0,0,0,0,0,0,1,1,1];
var sign_13 =  [1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,1,1,1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,1,1,1,1,1,1,1,0,0,0,0,0,0,0,0,0,0,1,1];
var sign_14 = [1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,1,1,1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,1,1,1,1,1,1,1,0,0,0,1,1,0,0,0,0,0,1,1];
var sign_15 = [1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,1,1,1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,1,1,1,1,1,1,1,0,0,0,1,1,0,0,0,0,0,1,1];
var sign_16 = [1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,1,1,1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,1,1,1,1,1,1,1,0,0,0,0,0,0,0,0,0,0,0,0];
var sign_17 = [1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,1,1,1,1,1,1,1,1,0,0,0,0,0,0,0,0,0,0,0];
var sign_18 = [1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0];
var sign_19 = [1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0];
var sign_20 = [1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,1];
var sign_21 = [1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,1];
var sign_22 = [1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,1];
var sign_23 = [1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,1];
var sign_24 = [1,1,1,1,1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,1];
var sign_25 =  [1,1,1,1,1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,1];
var sign_26 =  [1,1,1,1,1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,1];
var sign_27 =  [1,1,1,1,1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,1];
var sign_28 =  [1,1,1,1,1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,1];
var sign_29 =  [1,1,1,1,1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,1,1,1,0,0,1,1,1];
var sign_30 = [1,1,1,1,1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,1,1,1,1,0,1,1,1];
var sign_31 = [1,1,1,1,1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,1,1,1,1,0,1,1,1];
var sign_32 = [1,1,1,1,1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,1,1,1,1,0,1,1,1];
var sign_33 = [1,1,1,1,1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,1,1,1,1,0,1,1,1];
var sign_34 = [1,1,1,1,1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,1,1,0,0,1,1,1];
var sign_35 = [1,1,1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,1];
var sign_36 = [1,1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,1];
var sign_37 = [1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,1];
var sign_38 = [1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,1];
var sign_39 = [1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,1];
var sign_40 = [1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,1];
var sign_41 = [1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,1];
var sign_42 = [1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,1];
var sign_43 = [1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,1];
var sign_44 = [1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,1];
var sign_45 = [1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,1];
var sign_46 = [1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,1];
var sign_47 = [1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,1];
var sign_48 = [1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,1];
var sign_49 = [1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,1];
var sign_50 = [1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,1,1,1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,1];
var sign_51 = [1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,1,1,1,1,1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,1];
var sign_52 = [1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,1,1,1,1,1,1,1,1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,1];
var sign_53 = [1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,1];
var sign_54 = [1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,1];
var sign_55 = [1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,1];
var sign_56 = [1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,1,1,1,1,1,1,1,1,1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,1];
var sign_57 = [1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,1,1,1,1,1,1,1,1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,1,1,1,1,1];
var sign_58 = [1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,1,1,1,1,1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,1,1,1,1,1];
var sign_59 = [1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,1,1,1,1,1];
var sign_60 = [1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,1,1,1,1,1,1,1,1,1];
var sign_61 = [1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,1,1,1,1,1,1,1,1,1];
var sign_62 = [1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,1,1,1,1,1,1,1,1,1];
var sign_63 = [1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,0,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1];
var sign_64 = [1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,0,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1];
var sign_65 = [1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1];
var sign_map = sign_1.concat(sign_2,sign_3,sign_4,sign_5,sign_6,sign_7,sign_8,sign_9,sign_10,sign_11,sign_12,sign_13,sign_14,sign_15,sign_16,sign_17,sign_18,sign_19,sign_20,sign_21,sign_22,sign_23,sign_24,sign_25,sign_26,sign_27,sign_28,sign_29,sign_30,sign_31,sign_32,sign_33,sign_34,sign_35,sign_36,sign_37,sign_38,sign_39,sign_40,sign_41,sign_42,sign_43,sign_44,sign_45,sign_46,sign_47,sign_48,sign_49,sign_50,sign_51,sign_52,sign_53,sign_54,sign_55,sign_56,sign_57,sign_58,sign_59,sign_60,sign_61,sign_62,sign_63,sign_64,sign_65);
var sign_map_del = sign_1.concat(sign_2,sign_3,sign_4,sign_5,sign_6,sign_7,sign_8,sign_9,sign_10,sign_11,sign_12,sign_13,sign_14,sign_15,sign_16,sign_17,sign_18,sign_19,sign_20,sign_21,sign_22,sign_23,sign_24,sign_25,sign_26,sign_27,sign_28,sign_29,sign_30,sign_31,sign_32,sign_33,sign_34,sign_35,sign_36,sign_37,sign_38,sign_39,sign_40,sign_41,sign_42,sign_43,sign_44,sign_45,sign_46,sign_47,sign_48,sign_49,sign_50,sign_51,sign_52,sign_53,sign_54,sign_55,sign_56,sign_57,sign_58,sign_59,sign_60,sign_61,sign_62,sign_63,sign_64,sign_65);
var sign_goods = [];
var sign_X = sign_1.concat(sign_2,sign_3,sign_4,sign_5,sign_6,sign_7,sign_8,sign_9,sign_10,sign_11,sign_12,sign_13,sign_14,sign_15,sign_16,sign_17,sign_18,sign_19,sign_20,sign_21,sign_22,sign_23,sign_24,sign_25,sign_26,sign_27,sign_28,sign_29,sign_30,sign_31,sign_32,sign_33,sign_34,sign_35,sign_36,sign_37,sign_38,sign_39,sign_40,sign_41,sign_42,sign_43,sign_44,sign_45,sign_46,sign_47,sign_48,sign_49,sign_50,sign_51,sign_52,sign_53,sign_54,sign_55,sign_56,sign_57,sign_58,sign_59,sign_60,sign_61,sign_62,sign_63,sign_64,sign_65);
var sign_Y = sign_1.concat(sign_2,sign_3,sign_4,sign_5,sign_6,sign_7,sign_8,sign_9,sign_10,sign_11,sign_12,sign_13,sign_14,sign_15,sign_16,sign_17,sign_18,sign_19,sign_20,sign_21,sign_22,sign_23,sign_24,sign_25,sign_26,sign_27,sign_28,sign_29,sign_30,sign_31,sign_32,sign_33,sign_34,sign_35,sign_36,sign_37,sign_38,sign_39,sign_40,sign_41,sign_42,sign_43,sign_44,sign_45,sign_46,sign_47,sign_48,sign_49,sign_50,sign_51,sign_52,sign_53,sign_54,sign_55,sign_56,sign_57,sign_58,sign_59,sign_60,sign_61,sign_62,sign_63,sign_64,sign_65);


var Cultivation_sign = [40,41,120,121,201,281,361,441,521,594,601,606,608,681,682,683,684,685,644,645,646,647,648,649,650,651,652,653,654,655,656,657,658,659,660,661,662,663,664,665,666,667,668,669,670,671,672,673,674,675,676,677,678,679,723,724,774,803,824,825,826,827,828,829,830,831,832,833,854,855,856,857,858,859,860,861,862,863,864,865,866,867,868,869,870,871,872,873,877,904,905,906,907,908,909,910,911,912,913,935,936,937,938,939,940,941,942,943,944,945,946,947,948,949,950,951,952,953,954,955,956,984,985,986,987,988,989,990,991,992,993,1016,1017,1018,1019,1020,1021,1022,1023,1024,1025,1026,1027,1028,1029,1030,1031,1032,1033,1034,1035,1036,1037,1064,1065,1066,1067,1068,1069,1070,1071,1072,1073,1097,1098,1099,1100,1101,1102,1103,1104,1105,1106,1107,1108,1109,1110,1113,1114,1115,1116,1117,1144,1145,1146,1147,1148,1149,1150,1151,1152,1153,1178,1179,1180,1181,1182,1183,1184,1185,1186,1187,1188,1189,1190,1193,1194,1195,1196,1197,1224,1225,1226,1227,1228,1229,1230,1231,1232,1233,1258,1259,1260,1261,1262,1263,1264,1265,1266,1267,1268,1269,1270,1271,1272,1273,1274,1275,1276,1277,1278,1279,1304,1305,1306,1307,1308,1309,1310,1311,1338,1349,1350,1352,1353,1354,1355,1356,1357,1358,1359,1386,1387,1388,1389,1390,1418,1419,1420,1421,1422,1423,1424,1425,1426,1427,1428,1429,1432,1433,1434,1435,1436,1437,1438,1439,1518,1596,1676,1756,1836,1916,1996,2076,2156,2236,2316,2396,2476,2556,2636,2716,2725,2796,2804,2876,2883,2956,3036,3116,3196,3276,3,3356,3436,3516,3596,3676,3756,3836,3916,3996,4076,4156,4236,4316,4396,4476];

var Architecture_sign = [120,594,608,647,648,649,672,673,674,675,676,752,753,754,755,756,774,832,833,834,835,836,869,870,871,872,949,950,951,952,1029,1030,1031,1032,1109,1110,1188,1271,1272,1307,1308,1309,1352,1387,1388,1389,1424,1432,1433,1434,1435,1436,1437,1438];

var fruiter_sign = [1307,1308,1309,1387,1388,1389];





// [0纵向偏移,1横向偏移,2图片宽度,3图片高度,4占地宽度,5占地高度,"6春","7夏","8秋","9冬",10变化数量,"11名称","12介绍"];


var tool_icon = ["-1em","1em","2em"];
var fence_icon = ["0em","1em","1em"];
var flooring_icon = ["0em","1em","1em"];
var crops_icon = ["0em","1em","1em"];
var crops_0 = ["-1em","0em","1em","2em",1,1,"spring","none","none","none",5,"蓝爵士种子","春天下种。7天产出蓝色绒球花朵。"];//蓝调爵士
var crops_1 = ["-1em","0em","1em","2em",1,1,"spring","none","none","none",6,"花椰菜种子","春天播种。12天后长成大花椰菜。"];//花椰菜
var crops_2 = ["-1em","0em","1em","2em",1,1,"spring","none","none","none",5,"大蒜种子","春天播种。4天成熟。"];//蒜
var crops_3 = ["-1em","0em","1em","2em",1,1,"spring","none","none","none",7,"豌豆种子","春天播种。10天成熟，但是之后会不断结果。在架子上生长。"];//四季豆
var crops_4 = ["-1em","0em","1em","2em",1,1,"spring","none","none","none",5,"甘蓝种子","春天播种。6天成熟。用镰刀收获。"];//甘蓝菜
var crops_5 = ["-1em","0em","1em","2em",1,1,"spring","none","none","none",5,"防风草种子","春天播种。4天成熟。"];//防风草
var crops_6 = ["-1em","0em","1em","2em",1,1,"spring","none","none","none",6,"土豆种子","春天播种。6天成熟，有一定几率一次收获多个土豆。"];//土豆
var crops_7 = ["-1em","0em","1em","2em",1,1,"spring","none","none","none",6,"大黄种子","春天播种。13天成熟。"];//大黄
var crops_8 = ["-1em","0em","1em","2em",1,1,"spring","none","none","none",7,"草莓种子","春天下种。8天成熟，之后循环生产。"];//草莓
var crops_9 = ["-1em","0em","1em","2em",1,1,"spring","none","none","none",6,"郁金香球茎","春天下种。6天产出鲜艳花朵。多种颜色。"];//郁金香
var crops_10 = ["-1em","0em","1em","2em",1,1,"spring","summer","none","none",7,"咖啡豆","在夏季种植，长成咖啡树。在小桶里放五颗咖啡豆来制作咖啡。"];//咖啡豆
var crops_11 = ["-1em","0em","1em","2em",1,1,"spring","none","none","none",5,"水稻发芽","春天下种。8天成熟。如果种植在水体附近，生长会更快。用镰刀收获。"];//未碾米
var crops_12 = ["-1em","0em","1em","2em",1,1,"none","summer","none","none",7,"蓝莓种子","夏天播种。13天成熟，收获之后还能继续结果。"];//蓝莓
var crops_13 = ["-1em","0em","1em","2em",1,1,"none","summer","autumn","none",7,"玉米种子","夏天或秋天播种。14天成熟，收获之后还能继续结果。"];//玉米
var crops_14 = ["-1em","0em","1em","2em",1,1,"none","summer","none","none",7,"啤酒花种子","夏天播种。11天成熟，之后循环生产。在架子上生长。"];//啤酒花
var crops_15 = ["-1em","0em","1em","2em",1,1,"none","summer","none","none",6,"辣椒种子","夏天播种。5天成熟，收获之后还能继续结果。"];//辣椒
var crops_16 = ["-1em","0em","1em","2em",1,1,"none","summer","none","none",6,"甜瓜种子","夏天播种。12天成熟。"];//甜瓜
var crops_17 = ["-1em","0em","1em","2em",1,1,"none","summer","none","none",5,"萝卜种子","夏天播种。6天成熟。"];//小萝卜
var crops_18 = ["-1em","0em","1em","2em",1,1,"none","summer","none","none",6,"红叶卷心菜种子","夏天播种。9天成熟。"];//红叶卷心菜
var crops_19 = ["-1em","0em","1em","2em",1,1,"none","summer","none","none",6,"杨桃种子","夏天播种。13天成熟。"];//杨桃
var crops_20 = ["-1em","0em","1em","2em",1,1,"none","summer","none","none",7,"西红柿种子","夏天播种。11天成熟，收获之后还能继续结果。"];//西红柿
var crops_21 = ["-1em","0em","1em","2em",1,1,"none","summer","autumn","none",5,"小麦种子","夏天或秋天播种。4天成熟。用镰刀收获。"];//小麦
var crops_22 = ["-1em","0em","1em","2em",1,1,"none","summer","none","none",5,"虞美人种子","夏天下种。7天产出大红花。"];//虞美人
var crops_23 = ["-1em","0em","1em","2em",1,1,"none","summer","none","none",5,"夏季亮片种子","夏天下种。8天产出夺目的热带花朵。多种颜色。"];//夏季亮片
var crops_24 = ["-1em","0em","1em","2em",1,1,"none","summer","autumn","none",5,"向日葵种子","夏天或秋天播种。8天产出巨大向日葵。收割时产出更多种子。"];//向日葵
var crops_25 = ["-1em","0em","1em","2em",1,1,"none","none","autumn","none",5,"苋菜种子","秋天播种。7天成熟。用镰刀收获。"];//苋菜
var crops_26 = ["-1em","0em","1em","2em",1,1,"none","none","autumn","none",6,"洋蓟种子","秋天播种。8天成熟。"];//洋蓟
var crops_27 = ["-1em","0em","1em","2em",1,1,"none","none","autumn","none",5,"甜菜种子","秋天播种。6天成熟。"];//甜菜
var crops_28 = ["-1em","0em","1em","2em",1,1,"none","none","autumn","none",5,"小白菜种子","秋天播种。4天成熟。"];//小白菜
var crops_29 = ["-1em","0em","1em","2em",1,1,"none","none","autumn","none",7,"蔓越莓种子","秋天播种。7天成熟，收获之后还能继续结果。"];//蔓越莓
var crops_30 = ["-1em","0em","1em","2em",1,1,"none","none","autumn","none",7,"茄子种子","秋天播种。5天成熟，收获之后还能继续结果。"];//茄子
var crops_31 = ["-1em","0em","1em","2em",1,1,"none","none","autumn","none",7,"葡萄种子","秋天播种。10天成熟，之后循环生产。在架子上生长。"];//葡萄
var crops_32 = ["-1em","0em","1em","2em",1,1,"none","none","autumn","none",6,"南瓜种子","秋天播种。13天成熟。"];//南瓜
var crops_33 = ["-1em","0em","1em","2em",1,1,"none","none","autumn","none",5,"山药种子","秋天播种。10天成熟。"];//山药
var crops_34 = ["-1em","0em","1em","2em",1,1,"none","none","autumn","none",5,"玫瑰仙子种子","秋天下种。12天产出神秘的花朵。多种颜色。"];//玫瑰仙子
var crops_35 = ["-1em","0em","1em","2em",1,1,"none","none","autumn","none",6,"稀有种子","秋天播种。需要一个季度生长。"];//宝石甜莓
var crops_36 = ["-1em","0em","1em","2em",1,1,"spring","summer","autumn","winter",7,"上古种子","还能长出来吗？"];//上古水果
var crops_37 = ["-1em","0em","1em","2em",1,1,"spring","summer","autumn","winter",4,"茶苗","需要20天成熟。在每个季节最后一天产出产业，冬季除外。无需浇水。"];
var crops_38 = ["-1em","-1em","3em","3em",1,1,"spring","summer","autumn","winter",4,"草籽","把他种在你的农场上，来得到一块新的草坪。"];
var crops_39 = ["-3em","0em","3em","4em",3,3,"spring","summer","autumn","winter",1,"巨大的花椰菜","巨型作物必须用斧头收割。 可以跨季存活。不能在温室里成长。无法被祝尼魔收割。"];
var crops_40 = ["-3em","0em","3em","4em",3,3,"spring","summer","autumn","winter",1,"巨大的甜瓜","巨型作物必须用斧头收割。 可以跨季存活。不能在温室里成长。无法被祝尼魔收割。"];
var crops_41 = ["-3em","0em","3em","4em",3,3,"spring","summer","autumn","winter",1,"巨大的南瓜","巨型作物必须用斧头收割。 可以跨季存活。不能在温室里成长。无法被祝尼魔收割。"];
var cropsNum = [crops_0,crops_1,crops_2,crops_3,crops_4,crops_5,crops_6,crops_7,crops_8,crops_9,crops_10,crops_11,crops_12,crops_13,crops_14,crops_15,crops_16,crops_17,crops_18,crops_19,crops_20,crops_21,crops_22,crops_23,crops_24,crops_25,crops_26,crops_27,crops_28,crops_29,crops_30,crops_31,crops_32,crops_33,crops_34,crops_35,crops_36,crops_37,crops_38,crops_39,crops_40,crops_41];//农作物名单
// var otherName = [fence_0,fence_1];

// console.log(otherName[0]);

var other_0 = ["-1em","0em","1em","2em",1,1,"none","none","none","none",1,"木围栏","让小草以及动物呆在里面！"];
var other_1 = ["-1em","0em","1em","2em",1,1,"none","none","none","none",1,"石围栏","比木围栏更耐用。"];
var other_2 = ["-1em","0em","1em","2em",1,1,"none","none","none","none",1,"铁围栏","比石围栏更耐用。"];
var other_3 = ["-1em","0em","1em","2em",1,1,"none","none","none","none",1,"硬木围栏","一种最耐用的围栏。"];
var other_4 = ["-1em","0em","1em","2em",1,1,"none","none","none","none",1,"大门","让你有办法穿过围栏。"];
var other_5 = ["0em","0em","1em","1em",1,1,"none","none","none","none",1,"木地板","放置在地板上以修建出一条小路，也可以拿它来装点你的地板。"];
var other_6 = ["0em","0em","1em","1em",1,1,"none","none","none","none",1,"石头地板","放置在地板上以修建出一条小路，也可以拿它来装点你的地板。"];
var other_7 = ["0em","0em","1em","1em",1,1,"none","none","none","none",1,"风化地板","放置在地板上以修建出一条小路，也可以拿它来装点你的地板。"];
var other_8 = ["0em","0em","1em","1em",1,1,"none","none","none","none",1,"水晶地板","放置在地板上以修建出一条小路，也可以拿它来装点你的地板。"];
var other_9 = ["0em","0em","1em","1em",1,1,"none","none","none","none",1,"稻草地板","放置在地板上以修建出一条小路，也可以拿它来装点你的地板。"];
var other_10 = ["0em","0em","1em","1em",1,1,"none","none","none","none",1,"红砖地板","放置在地板上以修建出一条小路，也可以拿它来装点你的地板。"];
var other_11 = ["0em","0em","1em","1em",1,1,"none","none","none","none",1,"砾石小径","放置在地板上以修建出一条小路，也可以拿它来装点你的地板。"];
var other_12 = ["0em","0em","1em","1em",1,1,"none","none","none","none",1,"木头小径","放置在地板上以修建出一条小路，也可以拿它来装点你的地板。"];
var other_13 = ["0em","0em","1em","1em",1,1,"none","none","none","none",1,"水晶小径","放置在地板上以修建出一条小路，也可以拿它来装点你的地板。"];
var other_14 = ["0em","0em","1em","1em",1,1,"none","none","none","none",1,"鹅卵石小径","放置在地板上以修建出一条小路，也可以拿它来装点你的地板。"];
var other_15 = ["0em","0em","1em","1em",1,1,"none","none","none","none",1,"垫脚石小径","放置在地板上以修建出一条小路，也可以拿它来装点你的地板。"];
var other_16 = ["0em","0em","1em","1em",1,1,"none","none","none","none",1,"耕地","用于犁地和耕地。"];
var otherNum = [other_0,other_1,other_2,other_3,other_4,other_5,other_6,other_7,other_8,other_9,other_10,other_11,other_12,other_13,other_14,other_15,other_16,];//其他名单

var tool_0 = ["-1em","0em","1em","2em",1,1,"none","none","none","none",20,"宝箱","收藏你的物品的地方"];
var tool_1 = ["-1em","0em","1em","2em",1,1,"none","none","none","none",1,"稻草人","防止乌鸦袭击你的农作物。范围有限（大概8块“地块”）。"];
var tool_2 = ["-1em","0em","1em","2em",1,1,"none","none","none","none",1,"珍奇乌鸦","将它们全部收齐！（8-1）"];
var tool_3 = ["-1em","0em","1em","2em",1,1,"none","none","none","none",1,"珍奇乌鸦","将它们全部收齐！（8-2）"];
var tool_4 = ["-1em","0em","1em","2em",1,1,"none","none","none","none",1,"珍奇乌鸦","将它们全部收齐！（8-3）"];
var tool_5 = ["-1em","0em","1em","2em",1,1,"none","none","none","none",1,"珍奇乌鸦","将它们全部收齐！（8-4）"];
var tool_6 = ["-1em","0em","1em","2em",1,1,"none","none","none","none",1,"珍奇乌鸦","将它们全部收齐！（8-5）"];
var tool_7 = ["-1em","0em","1em","2em",1,1,"none","none","none","none",1,"珍奇乌鸦","将它们全部收齐！（8-6）"];
var tool_8 = ["-1em","0em","1em","2em",1,1,"none","none","none","none",1,"珍奇乌鸦","将它们全部收齐！（8-7）"];
var tool_9 = ["-1em","0em","1em","2em",1,1,"none","none","none","none",1,"珍奇乌鸦","将它们全部收齐！（8-8）"];
var tool_10 = ["-1em","0em","1em","2em",1,1,"none","none","none","none",1,"豪华稻草人","阻止乌鸦攻击你的庄稼。范围很大（大约16格）。"];
var tool_11 = ["-1em","0em","1em","2em",1,1,"none","none","none","none",1,"铱制洒水器","每天早晨灌溉临近的24个地块。"];
var tool_12 = ["-1em","0em","1em","2em",1,1,"none","none","none","none",1,"优质洒水器","每天早晨灌溉临近的8个地块。"];
var tool_13 = ["-1em","0em","1em","2em",1,1,"none","none","none","none",1,"洒水器","每天早上给四块邻近的土地浇水。"];
var tool_14 = ["-1em","0em","1em","2em",1,1,"none","none","none","none",1,"避雷针","收集暴风雨的能量，转换为电池。"];
var tool_15 = ["-1em","0em","1em","2em",1,1,"none","none","none","none",1,"工作台","在这里制作物品时，你可以使用任何相邻箱子中的材料。"];
var tool_16 = ["-1em","0em","1em","2em",1,1,"none","none","none","none",1,"蜂房","置放在屋外，然后等着吃甜蜜的蜂蜜吧！（除了冬天）。"];
var tool_17 = ["-1em","0em","1em","2em",1,1,"none","none","none","none",1,"小桶","置放水果或蔬菜在内。最终会变成饮品。"];
var tool_18 = ["-1em","0em","1em","2em",1,1,"none","none","none","none",1,"熔炉","将矿石和煤炭转换为金属方块。"];
var tool_19 = ["-1em","0em","1em","2em",1,1,"none","none","none","none",1,"罐头瓶","将蔬菜转换成泡菜，水果为果酱。"];
var tool_20 = ["-1em","0em","1em","2em",1,1,"none","none","none","none",1,"压酪机","将牛奶转换成乳酪。"];
var tool_21 = ["-1em","0em","1em","2em",1,1,"none","none","none","none",1,"织布机","将动物毛转换成美丽的布料。"];
var tool_22 = ["-1em","0em","1em","2em",1,1,"none","none","none","none",1,"产油机","生产松露美食油"];
var tool_23 = ["-1em","0em","1em","2em",1,1,"none","none","none","none",1,"回收机","将捕鱼废料转换为资源。"];
var tool_24 = ["-1em","0em","1em","2em",1,1,"none","none","none","none",1,"宝石复制机","置入你的宝石，它就会被复制。"];
var tool_25 = ["-1em","0em","1em","2em",1,1,"none","none","none","none",1,"蛋黄酱机","将鸡蛋转换为蛋黄酱。"];
var tool_26 = ["-1em","0em","1em","2em",1,1,"none","none","none","none",1,"煤炭窑","将10块木头转换成一块煤炭。"];
var tool_27 = ["-1em","0em","1em","2em",1,1,"none","none","none","none",1,"种子生产器","将谷物放入，将会产出各种各样的种子。对水果树类的谷物无效。"];
var tool_28 = ["-1em","0em","1em","2em",1,1,"none","none","none","none",1,"史莱姆孵化器","将史莱姆蛋孵化成史莱姆。让你能够在室外饲养史莱姆。"];
var tool_29 = ["-1em","0em","1em","2em",1,1,"none","none","none","none",1,"史莱姆压蛋器","压制100块史莱姆为一粒史莱姆蛋。简直是奇迹！"];
var tool_30 = ["-1em","0em","1em","2em",1,1,"none","none","none","none",1,"虫饵盒","稳定地提供诱饵。这些虫可以依靠自身维持生存。"];
var tool_31 = ["-1em","0em","1em","2em",1,1,"none","none","none","none",1,"碎木机","放入一块硬木，把它分解成普通的木头。"];
var tool_32 = ["-1em","0em","1em","2em",1,1,"none","none","none","none",1,"木桶","在地窖中使用以使产品变陈，如葡萄酒和奶酪。"];
var tool_33 = ["-1em","0em","1em","2em",1,1,"none","none","none","none",1,"花盆","在室内时，可种植任何季节的作物在户外时，只能容纳季节性作物。"];
var tool_34 = ["-1em","0em","1em","2em",1,1,"none","none","none","none",1,"大绿杖","农场的装饰件。"];
var tool_35 = ["-1em","0em","1em","2em",1,1,"none","none","none","none",1,"绿杖","农场的装饰件。"];
var tool_36 = ["-1em","0em","1em","2em",1,1,"none","none","none","none",1,"混色杖","农场的装饰件。"];
var tool_37 = ["-1em","0em","1em","2em",1,1,"none","none","none","none",1,"红杖","农场的装饰件。"];
var tool_38 = ["-1em","0em","1em","2em",1,1,"none","none","none","none",1,"大红杖","农场的装饰件。"];
var tool_39 = ["-1em","0em","1em","2em",1,1,"none","none","none","none",1,"木牌","在此上使用一个道具，即可改变显示的内容。道具不会被消耗掉。"];
var tool_40 = ["-1em","0em","1em","2em",1,1,"none","none","none","none",1,"石牌","在此上使用一个道具，即可改变显示的内容。道具不会被消耗掉。"];
var tool_41 = ["-1em","0em","1em","2em",1,1,"none","none","none","none",1,"邪恶雕像","这个雕像有点不太对劲。"];
var tool_42 = ["-1em","0em","1em","2em",1,1,"spring","summer","autumn","winter",1,"一簇鲜花","种植在橡木桶里的花朵。春天和夏天开花。"];
var tool_43 = ["-1em","0em","1em","2em",1,1,"none","none","none","none",1,"草坪火烈鸟","农场的装饰件。"];
var tool_44 = ["-1em","0em","1em","2em",1,1,"none","none","none","none",1,"装饰干草捆","农场的装饰件。"];
var tool_45 = ["-1em","0em","1em","2em",1,1,"none","none","none","none",1,"圆木段","农场的装饰件。"];
var tool_46 = ["-1em","0em","1em","2em",1,1,"none","none","none","none",1,"船标","农场的装饰件。"];
var tool_47 = ["-1em","0em","1em","2em",1,1,"none","none","none","none",1,"装甲","农场的装饰件。"];
var tool_48 = ["-1em","0em","1em","2em",1,1,"none","none","none","none",1,"墓石","农场的装饰件。"];
var tool_49 = ["-1em","0em","1em","2em",1,1,"none","none","none","none",1,"石蛙","适合农场的园艺。"];
var tool_50 = ["-1em","0em","1em","2em",1,1,"none","none","none","none",1,"石鹦鹉","适合农场的园艺。"];
var tool_51 = ["-1em","0em","1em","2em",1,1,"none","none","none","none",1,"石猫头鹰","适合农场的园艺。"];
var tool_52 = ["-1em","0em","1em","2em",1,1,"none","none","none","none",1,"石祝尼魔","适合农场的园艺。"];
var tool_53 = ["-1em","0em","1em","2em",1,1,"none","none","none","none",1,"刘易斯黄金像","市长的秘密项目。"];
var tool_54 = ["-1em","0em","1em","2em",1,1,"none","none","none","none",1,"汽水机","总会弹出美妙的东西。"];
var tool_55 = ["-1em","0em","1em","2em",1,1,"none","none","none","none",1,"无尽财富之雕像","黄金打造的。干什么用的呢？"];
var tool_56 = ["-1em","0em","1em","2em",1,1,"none","none","none","none",1,"完美雕像","由纯铱打造而成。"];
var tool_57 = ["-1em","0em","1em","2em",1,1,"none","none","none","none",1,"草原之王街机系统","在家里玩“草原之王的冒险之旅”！"];
var tool_58 = ["-1em","0em","1em","2em",1,1,"none","none","none","none",1,"祝尼魔赛车街机系统","在家玩“祝尼魔赛车”！"];
var tool_59 = ["-1em","0em","1em","2em",1,1,"none","none","none","none",1,"迷你点唱机","可以播放自己最喜欢的音乐。"];
var tool_60 = ["-1em","0em","1em","2em",1,1,"spring","summer","autumn","winter",1,"季节性装饰","此装饰随季节变化。"];
var tool_61 = ["-1em","0em","1em","2em",1,1,"spring","summer","autumn","winter",1,"季节性植物","随着季节变化的观赏性植物。不需要浇水。"];
var tool_62 = ["-1em","0em","1em","2em",1,1,"spring","summer","autumn","winter",1,"季节性植物","随着季节变化的观赏性植物。不需要浇水。"];
var tool_63 = ["-1em","0em","1em","2em",1,1,"spring","summer","autumn","winter",1,"季节性植物","随着季节变化的观赏性植物。不需要浇水。"];
var tool_64 = ["-1em","0em","1em","2em",1,1,"spring","summer","autumn","winter",1,"季节性植物","随着季节变化的观赏性植物。不需要浇水。"];
var tool_65 = ["-1em","0em","1em","2em",1,1,"spring","summer","autumn","winter",1,"季节性植物","随着季节变化的观赏性植物。不需要浇水。"];
var tool_66 = ["-1em","0em","1em","2em",1,1,"spring","summer","autumn","winter",1,"季节性植物","随着季节变化的观赏性植物。不需要浇水。"];
var tool_67 = ["-1em","0em","1em","2em",1,1,"none","none","none","none",1,"营火","提供一点亮光。"];
var tool_68 = ["-1em","0em","1em","2em",1,1,"none","none","none","none",1,"树桩火炬","提供一点亮光。"];
var tool_69 = ["-1em","0em","1em","2em",1,1,"none","none","none","none",1,"木头火炬","提供一点亮光。"];
var tool_70 = ["-1em","0em","1em","2em",1,1,"none","none","none","none",1,"石头火炬","提供一点亮光。"];
var tool_71 = ["-1em","0em","1em","2em",1,1,"none","none","none","none",1,"金制火炬","提供一点亮光。"];
var tool_72 = ["-1em","0em","1em","2em",1,1,"none","none","none","none",1,"镂空火炬","提供一点亮光。"];
var tool_73 = ["-1em","0em","1em","2em",1,1,"none","none","none","none",1,"骷髅火炬","提供一点亮光。"];
var tool_74 = ["-1em","0em","1em","2em",1,1,"none","none","none","none",1,"木桶火炬","提供一点亮光。"];
var tool_75 = ["-1em","0em","1em","2em",1,1,"none","none","none","none",1,"大理石火炬","提供一点亮光。"];
var tool_76 = ["-1em","0em","1em","2em",1,1,"none","none","none","none",1,"木灯柱","提供不少亮光。"];
var tool_77 = ["-1em","0em","1em","2em",1,1,"none","none","none","none",1,"铁灯柱","提供不少亮光。"];
var toolNum = [tool_0,tool_1,tool_2,tool_3,tool_4,tool_5,tool_6,tool_7,tool_8,tool_9,tool_10,tool_11,tool_12,tool_13,tool_14,tool_15,tool_16,tool_17,tool_18,tool_19,tool_20,tool_21,tool_22,tool_23,tool_24,tool_25,tool_26,tool_27,tool_28,tool_29,tool_30,tool_31,tool_32,tool_33,tool_34,tool_35,tool_36,tool_37,tool_38,tool_39,tool_40,tool_41,tool_42,tool_43,tool_44,tool_45,tool_46,tool_47,tool_48,tool_49,tool_50,tool_51,tool_52,tool_53,tool_54,tool_55,tool_56,tool_57,tool_58,tool_59,tool_60,tool_61,tool_62,tool_63,tool_64,tool_65,tool_66,tool_67,tool_68,tool_69,tool_70,tool_71,tool_72,tool_73,tool_74,tool_75,tool_76,tool_77];//打造名单





var tree_0 = ["-5em","-1em","3em","7em",1,1,"spring","summer","autumn","winter",7,"橡子","把它种在你的农场上以得到一棵橡树。"];
var tree_1 = ["-5em","-1em","3em","7em",1,1,"spring","summer","autumn","winter",7,"枫树种子","把它种在你的农场上以得到一棵枫树。"];
var tree_2 = ["-5em","-1em","3em","7em",1,1,"spring","summer","autumn","winter",7,"松果","把它种在你的农场上以得到一棵松树。"];
var tree_3 = ["-4em","-1em","3em","5em",1,1,"spring","summer","autumn","winter",6,"樱桃树苗","28天成熟为成年樱桃树。春天结果。只有在附近8块“地块”都空置的情况下才会成长。"];
var tree_4 = ["-4em","-1em","3em","5em",1,1,"spring","summer","autumn","winter",6,"杏子树苗","28天成熟为成年杏子树。春天结果。只有在附近8块“地块”都空置的情况下才会成长。"];
var tree_5 = ["-4em","-1em","3em","5em",1,1,"spring","summer","autumn","winter",6,"橙子树苗","28天成熟为成年橙子树。夏天结果。只有在附近8块“地块”都空置的情况下才会成长。。"];
var tree_6 = ["-4em","-1em","3em","5em",1,1,"spring","summer","autumn","winter",6,"桃子树苗","28天成熟为成年桃子树。夏天结果。只有在附近8块“地块”都空置的情况下才会成长。"];
var tree_7 = ["-4em","-1em","3em","5em",1,1,"spring","summer","autumn","winter",6,"石榴树苗","28天成熟为成年石榴树。秋天结果。只有在附近8块“地块”都空置的情况下才会成长。"];
var tree_8 = ["-4em","-1em","3em","5em",1,1,"spring","summer","autumn","winter",6,"苹果树苗","28天成熟为成年苹果树。秋天结果。只有在附近8块“地块”都空置的情况下才会成长。"];
var tree_9 = ["-5em","-1em","3em","7em",1,1,"spring","summer","autumn","winter",7,"大蘑菇","……"];
var treeNum = [tree_0,tree_1,tree_2,tree_3,tree_4,tree_5,tree_6,tree_7,tree_8,tree_9];


var Architecture_0 = ["0em","0em","1em","1em",0,0,"none","none","none","none",1,"基础农舍","……"];
var Architecture_1 = ["0em","0em","1em","1em",0,0,"none","none","none","none",1,"大农舍","增加了一个厨房，厨房里有一台用来储物的冰箱以及可以用来烹饪的橱柜。"];
var Architecture_2 = ["0em","0em","1em","1em",0,0,"none","none","none","none",1,"高级农舍","增加了两个新房间，一个是空着的，还有一个有一张婴儿床以及两个单人床。"];
var Architecture_3 = ["0em","0em","1em","1em",0,0,"none","none","none","none",1,"温室","可全年种植任何季节的作物的地方！"];
var Architecture_4 = ["0em","0em","1em","1em",0,0,"none","none","none","none",1,"温室（未修复）","可全年种植任何季节的作物的地方！"];
var Architecture_5 = ["-1em","0em","2em","3em",2,1,"none","none","none","none",1,"发货箱","把物品扔到里面，以便在夜间售出。"];
var Architecture_6 = ["-6em","0em","7em","8em",7,4,"none","none","none","none",1,"畜棚","可容纳4只家畜。"];
var Architecture_7 = ["-6em","0em","7em","8em",7,4,"none","none","none","none",1,"大畜棚","可容纳8只家畜。可让家畜产子。解锁山羊。"];
var Architecture_8 = ["-6em","0em","7em","8em",7,4,"none","none","none","none",1,"高级畜棚","可容纳12只家畜。附带自动喂养系统。解锁绵羊和猪。"];
var Architecture_9 = ["-6em","0em","6em","8em",6,3,"none","none","none","none",1,"鸡舍","可容纳4只家禽。"];
var Architecture_10 = ["-6em","0em","6em","8em",6,3,"none","none","none","none",1,"大鸡舍","可容纳8只家禽。附带孵化器。解锁鸭。"];
var Architecture_11 = ["-6em","0em","6em","8em",6,3,"none","none","none","none",1,"高级鸡舍","可容纳12只家禽。附带自动喂养系统。解锁兔子。"];
var Architecture_12 = ["-6em","0em","5em","8em",5,3,"none","none","none","none",1,"小屋","朋友的家！由城镇农业基金补贴。"];
var Architecture_13 = ["-6em","0em","5em","8em",5,3,"none","none","none","none",1,"小屋","朋友的家！由城镇农业基金补贴。"];
var Architecture_14 = ["-6em","0em","5em","8em",5,3,"none","none","none","none",1,"小屋","朋友的家！由城镇农业基金补贴。"];
var Architecture_15 = ["-6em","0em","5em","8em",5,3,"none","none","none","none",1,"小屋","朋友的家！由城镇农业基金补贴。"];
var Architecture_16 = ["-6em","0em","5em","8em",5,3,"none","none","none","none",1,"小屋","朋友的家！由城镇农业基金补贴。"];
var Architecture_17 = ["-6em","0em","5em","8em",5,3,"none","none","none","none",1,"小屋","朋友的家！由城镇农业基金补贴。"];
var Architecture_18 = ["-6em","0em","5em","8em",5,3,"none","none","none","none",1,"小屋","朋友的家！由城镇农业基金补贴。"];
var Architecture_19 = ["-6em","0em","5em","8em",5,3,"none","none","none","none",1,"小屋","朋友的家！由城镇农业基金补贴。"];
var Architecture_20 = ["-6em","0em","5em","8em",5,3,"none","none","none","none",1,"小屋","朋友的家！由城镇农业基金补贴。"];
var Architecture_21 = ["-7em","0em","7em","9em",7,3,"none","none","none","none",1,"小屋","一栋空的建筑。装入任何你想装的东西！可以装饰内部。"];
var Architecture_22 = ["-7em","0em","7em","9em",7,3,"none","none","none","none",1,"大屋子","让屋子的尺寸翻倍。内部可以装饰。"];
var Architecture_23 = ["-5em","0em","4em","7em",4,2,"none","none","none","none",1,"马厩","让你饲养马匹。包括马匹。"];
var Architecture_24 = ["-7em","0em","3em","9em",3,3,"none","none","none","none",1,"筒仓","让你把割下来的草料储存起来。"];
var Architecture_25 = ["-4em","0em","3em","6em",3,3,"none","none","none","none",1,"水井","用来重装你的喷壶。"];
var Architecture_26 = ["-7em","0em","4em","9em",4,2,"none","none","none","none",1,"磨坊","让你将小麦制成面粉，将甜菜根制成糖。"];
var Architecture_27 = ["-4em","0em","3em","6em",3,2,"none","none","none","none",1,"黄金时钟","阻止杂物出现在你的农场。防止篱笆腐烂。"];
var Architecture_28 = ["-8em","0em","11em","10em",11,6,"none","none","none","none",1,"史莱姆屋","可饲养20只史莱姆。装满饮水槽，史莱姆就会制造史莱姆球。"];
var Architecture_29 = ["-3em","0em","3em","5em",3,2,"spring","summer","autumn","winter",1,"祝尼魔屋","祝尼魔会为你收割小屋周围的庄稼。"];
var Architecture_30 = ["-7em","0em","3em","9em",3,2,"none","none","none","none",1,"水方尖塔","将你传送到海滩。"];
var Architecture_31 = ["-7em","0em","3em","9em",3,2,"none","none","none","none",1,"土方尖塔","将你传送到山岭。"];
var Architecture_32 = ["-7em","0em","3em","9em",3,2,"none","none","none","none",1,"沙方尖塔","将你传送到沙漠。"];
var Architecture_33 = ["-4em","0em","5em","6em",5,5,"none","none","none","none",1,"鱼塘","养鱼并收获水产品。鱼会随着时间的推移而繁殖。"];
var Architecture_34 = ["-1em","0em","2em","2em",2,2,"none","none","none","none",1,"陨石","夜晚听到一声巨响……"];
var ArchitectureNum = [Architecture_0,Architecture_1,Architecture_2,Architecture_3,Architecture_4,Architecture_5,Architecture_6,Architecture_7,Architecture_8,Architecture_9,Architecture_10,Architecture_11,Architecture_12,Architecture_13,Architecture_14,Architecture_15,Architecture_16,Architecture_17,Architecture_18,Architecture_19,Architecture_20,Architecture_21,Architecture_22,Architecture_23,Architecture_24,Architecture_25,Architecture_26,Architecture_27,Architecture_28,Architecture_29,Architecture_30,Architecture_31,Architecture_32,Architecture_33,Architecture_34];//建筑名单

var tool_Title = ["喷壶","锄头","斧头","十字镐","染色剂"];
var tool_text = ["用于改变农作物生长状态","用于犁地和耕地","用于改变树木生长状态（包括树液采集器）","用于清除已放置物品（建筑请点击左下角）","用于给宝箱染色"];

































































































